In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.read_excel('cities.xlsx')

In [3]:
df2= pd.read_excel('City.xlsx')

In [4]:
df

           cities
0  Vishakhapatnam
1   Vishakapatnam
2    visakapatnam
3   Visakapathnam
4          Bombay
5           abcde
6  Vishakhapatnam
7    visakapatnam
8          Bombay

In [5]:
df2

             City  C
0  Vishakhapatnam  1
1          Bombay  2

In [6]:
df2.index.to_list()

[0, 1]

In [7]:
from fuzzywuzzy import fuzz
from fuzzywuzzy import process
df3= []

/home/ravi/.local/lib/python3.8/site-packages/fuzzywuzzy/fuzz.py:11: UserWarning: Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning
  warnings.warn('Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning')

In [8]:
for i in df.index:
    C1=df.at[i,"cities"]
    for j in df2.index:
        C2=df2.at[j,"City"]
        df3_token=fuzz.partial_ratio(C1,C2)
        if df3_token>80:
            df3.append([C1,C2,df3_token])

In [9]:
df3

[['Vishakhapatnam', 'Vishakhapatnam', 100],
 ['Vishakapatnam', 'Vishakhapatnam', 92],
 ['visakapatnam', 'Vishakhapatnam', 83],
 ['Visakapathnam', 'Vishakhapatnam', 85],
 ['Bombay', 'Bombay', 100],
 ['Vishakhapatnam', 'Vishakhapatnam', 100],
 ['visakapatnam', 'Vishakhapatnam', 83],
 ['Bombay', 'Bombay', 100]]

In [10]:
type(df3)

list

In [11]:
from pandas import DataFrame

In [12]:
df4 = DataFrame.from_records(df3)

In [13]:
df4.columns= ["cities","City","Match_score"]
df4

           cities            City  Match_score
0  Vishakhapatnam  Vishakhapatnam          100
1   Vishakapatnam  Vishakhapatnam           92
2    visakapatnam  Vishakhapatnam           83
3   Visakapathnam  Vishakhapatnam           85
4          Bombay          Bombay          100
5  Vishakhapatnam  Vishakhapatnam          100
6    visakapatnam  Vishakhapatnam           83
7          Bombay          Bombay          100

In [14]:
df5 = df4.groupby('City').agg(lambda x: x.tolist())

In [15]:
df5

,cities,Match_score
City,,
Bombay,"[Bombay, Bombay]","[100, 100]"
Vishakhapatnam,"[Vishakhapatnam, Vishakapatnam, visakapatnam, ...","[100, 92, 83, 85, 100, 83]"

In [16]:
df6 = df5.reset_index()

In [17]:
df6

,City,cities,Match_score
0,Bombay,"[Bombay, Bombay]","[100, 100]"
1,Vishakhapatnam,"[Vishakhapatnam, Vishakapatnam, visakapatnam, ...","[100, 92, 83, 85, 100, 83]"

In [18]:
columnNames= df6.columns.values

In [19]:
type(df5)

pandas.core.frame.DataFrame

In [20]:
listOfColumns =  list(columnNames)

In [21]:
print("List of Column", listOfColumns, sep='\n')

List of Column
['City', 'cities', 'Match_score']

In [22]:
df6.merge(df2,on='City', how='left')

,City,cities,Match_score,C
0,Bombay,"[Bombay, Bombay]","[100, 100]",2
1,Vishakhapatnam,"[Vishakhapatnam, Vishakapatnam, visakapatnam, ...","[100, 92, 83, 85, 100, 83]",1